flappyBird_20degrees/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin  0.0;
xmax  5.0;
ymin -7.0;
ymax  2.0;
zmin -2.0;
zmax  2.0;

//xcells 30;
//ycells 20;
//zcells 20;

lx #calc "$xmax - $xmin";
dx 0.15;
xcells #calc "floor(abs(($lx)/($dx)))";

ly #calc "$ymax - $ymin";
dy 0.15;
ycells #calc "floor(abs(($ly)/($dy)))";

lz #calc "$zmax - $zmin";
dz 0.15;
zcells #calc "floor(abs(($lz)/($dz)))";


vertices        
(
    ($xmin  $ymin  $zmin)
    ($xmax  $ymin  $zmin)
    ($xmax  $ymax  $zmin)
    ($xmin  $ymax  $zmin)
    ($xmin  $ymin  $zmax)
    ($xmax  $ymin  $zmax)
    ($xmax  $ymax  $zmax)
    ($xmin  $ymax  $zmax)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch minX
    (
        (0 4 7 3)
    )
    patch maxX
    (
        (2 6 5 1)
    )
    patch minY
    (
        (1 5 4 0)
    )
    patch maxY 
    (
        (3 7 6 2)
    )
    patch minZ
    (
        (0 3 2 1)
    )
    patch maxZ
    (
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
