flappyBird_20degrees/0/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 -1. 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 0 -1. 0 );
    }
    outlet
    {
        type            inletOutlet;
        value           uniform ( 0 -1. 0 );
        inletValue      uniform ( 0 0 0 );
    }
    wing
    {
        type            movingWallVelocity;
        value           uniform ( 0 0 0 );
    }
    "(top|bottom|left|right)"
    {
        type            slip;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
