flappyBird_20degrees/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];
internalField   uniform ( 0 -71.5 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value			uniform (0 -71.5 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    symmetry
    {
        type            symmetry;
    }
    wing
    {
        type            fixedValue;
        value			uniform (0 0 0);
        //type            movingWallVelocity;
        //value           uniform ( 0 0 0 );
    }
    top
    {
        type            fixedValue;
        value			uniform (0 -71.5 0);
    }
    bottom
    {
        type            fixedValue;
        value			uniform (0 -71.5 0);
    }
}


// ************************************************************************* //
