flappyBird_20degrees/0/0.org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 0 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    /*
    outside
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    */
    wing
    {
        type            JwaveDisplacement;
        amplitude       ( 1.9 0 0 );			// sigmoid transition point
        omega           10;	//3.14;	
        waveNumber      ( 1.9 0 0 );			// rotation point
        value           uniform ( 0 0 0 );
    	/*
        type            JwaveDisplacement;
        amplitude       ( 0. 0. 1. );
        omega           1;
        waveNumber      ( 0 2 0 );	//( 2 -0.492 0.011 );
        value           uniform ( 0 0 0 );
		*/
    }
    box_1
    {
        type            slip;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
