flappyBird_20degrees/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
r=0.008
mDot=0.05
rho=1000
I=0.05
L=r
Cmu=0.09

A=np.pi*r**2
V=mDot/A/rho
k=1.5*V**2*I
epsilon=Cmu**0.75*k**1.5/L
*/

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 20;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
		type			fixedValue;
		value			uniform 20;
    }
    outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    symmetry
    {
        type            symmetry;
    }
    wing
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    top
    {
		type			fixedValue;
		value			uniform 20;
    }
    bottom
    {
		type			fixedValue;
		value			uniform 20;
    }
}
// ************************************************************************* //
