flappyBird_20degrees/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 250000;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 250000;
    }
    outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    symmetry
    {
        type            symmetry;
    }
    wing
    {
        type            omegaWallFunction;
        value           uniform 4000000;
    }
    top
    {
        type            fixedValue;
        value           uniform 250000;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 250000;
    }
}


// ************************************************************************* //
