flappyBird_20degrees/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;	
    //grad(p)         Gauss linear;
    //grad(U)         Gauss linear;

    //default          cellMDLimited Gauss linear 1.0;
    //default          cellLimited Gauss linear 1.0;

    //grad(U)          cellLimited Gauss linear 1.0;
    //grad(p)          cellLimited Gauss linear 1.0;
    //grad(k)            cellLimited Gauss linear 1.0;
    //grad(omega)        cellLimited Gauss linear 1.0;

    limited            cellLimited Gauss linear 1.0;
}

divSchemes
{
    default         none;

    //div(phi,U)      bounded Gauss linearUpwind grad(U);		//div
    div(phi,U)      bounded Gauss linearUpwindV limited;
    //div(phi,U)      bounded Gauss upwind grad(U);

    //div(phi,omega)  bounded Gauss linearUpwind default;
    //div(phi,k)      bounded Gauss linearUpwind default;

    //div(phi,omega)  bounded Gauss linearUpwind limited;
    //div(phi,k)      bounded Gauss linearUpwind limited;

    div(phi,omega)  bounded Gauss upwind;
    div(phi,k)      bounded Gauss upwind;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
      default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
