flappyBird_20degrees/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("wing.stl");

// Identify a feature when angle between faces < includedAngle
includedAngle       150;

subsetFeatures
{
    // Keep nonManifold edges (edges with >2 connected faces)
    nonManifoldEdges       no;

    // Keep open edges (edges with 1 connected face)
    openEdges       yes;
}

// Write features to obj format for postprocessing
writeObj                yes;

// ************************************************************************* //
